/* eslint-disable */

export default {
    hello: 'Привет, я',
    name: 'Дмитро',
    specialization: 'Front-end разработчик',
    about1:
        'Мне %s. Люблю музыку, учусь играть на электрогитаре. Увлекаюсь путешествиями, готовкой, спидраннингом видеоигр, игрой с йо-йо и программированием.',
    about2: 'Люблю JavaScript со всеми его курьёзами :)',
    region: 'Украина, Черкасская область',
    aboutMeBtn: 'Обо мне',
    portfolio: 'Портфолио',
    skillsTitle: 'Профессиональные навыки',
    frontEndTechs: 'Front-end технологии',
    backEndTechs: 'Back-end технологии',
    now: 'текущий момент',
    skills: 'Навыки',
    experience: 'Опыт',
    education: 'Образование',
    frontEndDev: 'Front-end разработчик',
    jobSession: 'Период: с %s по %s',
    cpv2: 'Панель управления сайтом uCoz 2.0',
    duties: 'Обязанности',
    achievements: 'Достижения',
    cpDuty1: 'Добавление новых и поддержка старых решений',
    cpDuty2: 'Усовершенствование старых и малопроизводительных решений',
    cpDuty3: 'Разработка кросс-браузерных компонентов с нуля: от UI/UX до серверного API',
    cpDuty4: `Полная ответственность за работоспособность front-end'а проекта`,
    task: 'Задание',
    result: 'Результат',
    projectDescription: 'Описание',
    cpTask1: 'Адаптировал проект под мобильные устройства и планшеты',
    cpTask2: 'Полностью переписал ядро проекта (300+ модулей, 10000+ строк) с Grunt и ES5 на ES-модули и Webpack',
    cpTask3:
        'Инициировал переход от jQuery на Vue, выполнил настройку фреймворка под экосистему проекта, переписал часть функционала на Vue, создал основу для постепенной миграции с jQuery на Vue',
    cpTask4:
        'Покрыл все Vue компоненты + часть старого кода Unit тестами (всего около 400 тестов), настроил выполнение тестирования перед пушем ветки',
    cpTask5:
        'Написал большое количество полезных компонентов, среди которых: виджеты сайта; модуль управления комментариями; модуль фильтров для материалов и массовых операций над ними; модуль, позволяющий отображать дерево категорий материалов и управлять ими',
    cpTask6:
        'Интегрировал в проект vue-router, выполнил его настройку под нужды проекта, заменил ним старый самописный router',
    cpResult1: 'Панель управления стала адаптивной и более удобной при работе с мобильных устройств',
    cpResult2:
        'Размер ресурсов сайта уменьшился на 20%, проект стал работать быстрее, код стал более структурированным и модульным, его стало проще поддерживать',
    cpResult3: 'Увеличилась скорость разработки нового функционала и поддержки старого',
    cpResult4: 'Возросла стабильность работы функционала',
    cpResult5:
        'Новые компоненты позволяют облегчить настройку сайта, автоматизируют большое количество рутинных операций',
    cpResult6:
        'Навигация сайта начала работать более стабильно, заложил основу для использования связки Vue + vue-router в будущем',
    cpDescription:
        'Панель администратора сайта, где он может редактировать внешний вид сайта, добавлять/удалять/редактировать материалы множества готовых модулей, управлять учетными записями пользователей, изменять настройки сайта в общем.',
    results: 'Результаты',
    imageGalleryDescription: 'Нажмите на фото, чтобы увидеть увеличенную версию',
    ucalc: 'Модуль статистики для проекта uCalc',
    uCalcDescription:
        'uCalc - это конструктор интерактивных форм и калькуляторов, которые можно легко интегрировать в свой сайт. Модуль статистики позволяет администратору отслеживать и отображать в удобной интерактивной форме количество показов калькулятора, количество заполнений форм и другие параметры, такие как: пол, возраст или версия браузера пользователей. Также с помощью него можно интегрировать Яндекс.Метрику и Google Analytics в калькулятор за пару кликов',
    ucalcDuty1: 'Создание кастомных графиков разных типов согласно макетам',
    ucalcDuty2: 'Визуализация данных с сервера, используя созданные графики',
    ucalcDuty3: 'Создание UI для интеграции статистики Yandex.Metrica и Google Analytics в проект',
    mlDescription:
        'Mass Labeling - это полувнутренний проект, написанный для автоматизации работы службы поддержки. Его основная задача состоит в том, чтобы в автоматическом режиме показать каждому работнику набор дизайнов сайтов (сайты могут повторяться среди работников), чтобы тот поставил субъективную оценку дизайну сайта от 1 до 10. Позже вычисляется среднее арифметическое оценки для каждого сайта и сравнивается с оценкой дизайна этого сайта, которую дала нейросеть. Одна из целей проекта - улучшить производительность службы поддержки путём подачи только нужных дизайнов и максимального облегчения установки оценки. Другая цель - научить нейросеть в автоматическом режиме максимально точно вычислять оценку сайта без участия человека.',
    mlDuty1: 'Разработал функционал для ведения учетных записей пользователей (аккаунтов работников/администраторов)',
    mlDuty2: 'Разработал функционал выбора пользователем языка интерфейса',
    mlDuty3:
        'Разработал функционал для создания, редактирования, назначения задач (для администраторов). Задачи описывают, какие наборы дизайнов должен оценить тот или иной работник',
    mlDuty4:
        'Разработал функционал для просмотра статистики оценок каждого из работников: оценка работника, средняя оценка этого дизайна, отклонение от средней оценки и др.',
    mlDuty5: 'Разработал функционал глобальных настроек системы',
    mlTask1:
        'Интегрировал Webpack, переписал существующий функционал используя ES-модули, внедрил минификацию для JS/CSS',
    mlTask2: 'Внедрил i18n в проект',
    mlResult1: 'Стало проще работать с Front-end частью проекта и разрабатывать новый функционал',
    mlResult2: 'Проект начал поддерживать Русский и Английский языки',
    college: 'Черкасский политехнический техникум',
    university: 'Черкасский государственный технологический университет',
    juniorSpecialist: 'Младший специалист',
    bachelor: 'Бакалавр',
    master: 'Магистр',
    phd: 'Аспирант',
    juniorSpecialistGraduationWorkTopic:
        'Тема дипломной работы: проектирование и создание Android-приложения для туристического агенства',
    bachelorGraduationWorkTopic: 'Тема дипломной работы: проектирование и разработка 2D аркады, используя Java Swing',
    masterGraduationWorkTopic: 'Тема дипломной работы: проектирование и разработка 2D аркады, используя Java Swing',
    phdGraduationWorkTopic: 'Тема диссертации: создание 3D модели рентгеновского исследования',

    demoLink: 'Демо',
    githubLink: 'Репозиторий Github',

    newcpGuideDescription:
        'Этот проект - это сборник ответов на самые важные вопросы, которые касаются разработки фронт-енда "Панели упраления uCoz 2.0". Он может использоваться бэк-енд разработчиками и будущими фронт-енд разработчиками и содержит инструкции и рекомендации по работе с основными модулями и разработке в целом.<br>Со страницы администратора проект позволяет создавать, редактировать (используя встроенный markdown-редактор) и удалять вопросы и ответы к ним. Список вопросов для удобства можно фильтровать.',
    sthDescription:
        'Небольшое дополнение для Google Chrome, которое позволяет автоматически собирать цены отслеживаемых внутриигровых предметов Steam и автоматически высчитывать выгоду при их перепродаже. Присылает пуш-уведомление, если выгода предмета превышает установленную в настройках.',
    sthApiDescription:
        'API сервер для хранения данных для steam-trade-helper. Сохраняет в базу данных отслеживаемые предметы, а также настройки расширения.',
    ubikedayDescription: 'Тематический лэндинг, сделанный к событию "uBikeDay 2019"',
    wpDescription: 'Лэндинг для внутреннего конкурса "Лучший промо-лэндинг для игры WebTycoon"',
    myPortfolioDescription:
        'Single Page Application, где можно найти полную информацию о моих хобби, опыте работы, образовании, способах связи со мной, а также моих проектах.',

    uAdvDescription: 'Разработка и усовершенствование модулей рекламы uCoz',
    uAdvDuty1:
        'Разработка рекламных модулей для системы разных типов: стикер, полноэкранное видео, push-подписки; доработка готовых решений',
    uAdvDuty2: 'Изменение параметров рекламных модулей',
    uAdvDuty3: 'Формирование рекламных цепочек, изменение порядка рекламных модулей в них',

    title: 'Дмитрий Кит - персональный веб-сайт',
    restFinder: 'Service is a SPA web resource that allows you to choose a place to rest in Cherkasy according to various criteria. After visiting a place you can rate it and write a review.',
    restFinderAPI: 'API сервер для проекта Rest Finder. Обсуживает запросы фронт-енда, ежедневно обновляет данные о заведениях используя Google Places API',
};
